misterniark/Meshpay-V2/sdkconfig.defaults.tdeck
# LILYGO T-Deck Plus — profil fondateur (création de monnaie).
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# T-Deck : 8 MB PSRAM.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# CONFIG_MESHPAY_BOARD_UNKNOWN is not set
CONFIG_MESHPAY_BOARD_LILYGO_TDECK=y

# Table de partitions dédiée (flash claire) AVEC la partition dagstore, sinon
# storage_ready=false → identité non persistée + create_currency refusé (le
# fondateur retombe en client). Cf. partitions_tdeck.csv.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_tdeck.csv"

# Profil fondateur : ESP-NOW (découverte) + LoRa Core1262 (sync DAG).
# Démarrage en ESP-NOW d'abord (bus SPI écran/LoRa partagé, cf. Task 11 du plan).
CONFIG_MESHPAY_RADIO_ESPNOW_LORA_CORE1262=y
CONFIG_MESHPAY_FORCE_ESPNOW_ONLY=y
CONFIG_MESHPAY_ESPNOW_CHANNEL=1

# SX1262 du T-Deck : MÊME host SPI que l'écran ST7789 (SPI2_HOST = valeur 1),
# car SCK/MOSI/MISO (40/41/38) sont des broches PARTAGÉES. Mettre le LoRa sur un
# autre host (ex. 2 = SPI3) reroute ces broches vers l'autre périphérique SPI et
# casse l'affichage dès l'init radio (le driver écran garde le bus, le LoRa s'y
# greffe comme 2ᵉ device — cf. tolérance INVALID_STATE côté core1262).
CONFIG_MESHPAY_LORA_C1262_SPI_HOST=1
CONFIG_MESHPAY_LORA_C1262_PIN_SCK=40
CONFIG_MESHPAY_LORA_C1262_PIN_MOSI=41
CONFIG_MESHPAY_LORA_C1262_PIN_MISO=38
CONFIG_MESHPAY_LORA_C1262_PIN_NSS=9
CONFIG_MESHPAY_LORA_C1262_PIN_RESET=17
CONFIG_MESHPAY_LORA_C1262_PIN_BUSY=13
CONFIG_MESHPAY_LORA_C1262_PIN_DIO1=45
CONFIG_MESHPAY_LORA_C1262_PIN_RXEN=-1
CONFIG_MESHPAY_LORA_C1262_PIN_TXEN=-1
CONFIG_MESHPAY_LORA_C1262_PIN_AUX_CS=39
CONFIG_MESHPAY_LORA_C1262_FREQUENCY_HZ=868100000
CONFIG_MESHPAY_LORA_C1262_TCXO_CTRL_VOLTAGE=2
CONFIG_MESHPAY_LORA_C1262_CALIBRATE_IMAGE=y
CONFIG_MESHPAY_LORA_C1262_TX_POWER_DBM=14
